Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN Who's Mr. President.tmx
Source language: id
Languages: en

source: Tidak aneh kalau orang itu mengambil kesempatan ini untuk membuat ulah!
en: ...they saw this as an opportunity to cause trouble!

source: KATANYA NANTI
en: He said

source: TAPI KENAPA?
en: Why?

source: KALAU IBU AKAN
en: going to get

source: WAKTU BERSAMA DENGAN
en: amount of time

source: KARENA OSIS
en: is not about

source: ...BENAR,
en: right.

source: SAAT INI…
en: while...

source: TAPI SAAT INI AKU TIDAK BISA TERLALU TERBURU-BURU MENYIMPULKAN,
en: it’s too early to draw a conclusion.

source: DIGUNAKAN KEPSEK
en: used by the headmaster

source: MEMBERITAHU SAYA
en: tell me

source: TERKEJUT,
en: surprise me,

source: TIDAK ADA LAGI
en: There’s nothing

source: KAGET YA.
en: calm, okay?

source: BELAH PIHAK BISA
en: understand

source: CHIARA TIDAK MAU
en: chiara doesn’t want

source: Apa sejak awal aku adalah target mereka?
en: was I their target in the first place?

source: BIKIN CERITA
en: spouting nonsense,

source: Jangan khawatir, setelah semua ini beres saya akan memarahimu tanpa ampun.
en: don’t worry, after all of this is done, I’ll show you no mercy.

source: LALU BARUSAN JUGA
en: Oh, and

source: SUDAH LAMA
en: It’s been a while

source: KITA PERGI!
en: Let’s go find something to eat!

source: DARI KELAS 12-A, DIHARAP
en: please head to the auditorium

source: PENJELASANKU…
en: my explanation...

source: saja 'kan.
en: right?

source: ...SOALNYA ANEH, BUKAN?
en: I mean, it’s odd, right?

source: YANG AKU KATAKAN.
en: I’ve said.

source: BIARKAN CHIARA
en: to leave her alone

source: Kamu satu-satunya anggota OSIS yang diketahui oleh orang-orang, artinya posisimu berbahaya.
en: being the only known OSIS member makes your position very risky.

source: TIDAK MENYANGKA
en: not have expected that

source: BERKAT ITU,
en: Then,

source: KAMU INI TIDAK
en: changed at all, huh?!

source: WAKATOS, PADAHAL ANGGOTA
en: while the other

source: SI ANAK
en: Lover

source: KARENA SUATU
en: Because of various reasons,

source: DULU APA CANDAANMU?
en: what was the joke you used to tell me?

source: BICARA,
en: with me,

source: DAN DIA SAMA
en: she found out that Leo has no

source: MEMPERMALUKAN
en: picking

source: KAK NAOMI,
en: with Naomi,

source: KEMARIN KETUA
en: Yesterday,

source: MENIMBULKAN
en: raise

source: TIBA-TIBA TERLIHAT
en: he seemed to be

source: KASUS TERTENTU
en: cases where

source: kamu belum pulang?
en: I’ve finished practice?

source: SELAMA INI…
en: all this time...

source: KENAPA TATAPANMU
en: You looked

source: WAKTUNYA KITA
en: for us to stop

source: J-JADI AKU...
en: actually, I...

source: CHIARA ADALAH ANAK YANG DULUNYA TIDAK BENAR-BENAR PUNYA TEMAN YANG DEKAT,
en: chiara had no close friends before this.

source: CHIARA, BERSIAP
en: Chiara, get ready!

source: ANGGOTA OSIS DI
en: you with several members of OSIS

source: KALAU AKAN
en: This

source: KAK LEO,
en: Leo,

source: Hubungi Chiara sekarang juga!!
en: call chiara now!!!

source: EZRA PUN BISA MENDENGAR
en: Ezra will be able to eavesdrop on

source: apa yang kau minta.
en: what you asked.

source: AKU BERPIKIR KALAU
en: I thought that

source: Aku bisa merasakan Cantika ada di sebelahku, dia baik-baik saja, 'kan?
en: I can feel cantika beside me. she’s okay, right?

source: TEATER DAN AKU YAKIN
en: and I’m pretty sure we haven’t

source: AKU MERASAKAN AURA YANG SERUPA JUGA DENGAN KEVIN SANJAYA.
en: I have the same thoughts about kevin sanjaya.

source: KATAMU
en: you just

source: bersalah pada
en: for

source: AKAN JADI ALASAN,
en: It won’t matter.

source: BERPIKIR BEGITU.
en: coming from.

source: DUH, BENAR-BENAR DEH...
en: tsk, seriously...

source: Kalian semua hanya anak SMA labil.
en: you’re just a bunch of befuddled teenagers.

source: TIDAK ADA.
en: maybe you shouldn’t trust me either, huh?

source: AKU SENDIRI KAGET,
en: I’m still surprised.

source: BENAR 'KAN, NAOMI?
en: right, naomi?

source: JADI JANGAN LAKUKAN HAL INI LAGI.
en: so please don’t do this again.

source: S-SEBENTAR…
en: What’s happened

source: AKU ASAL MENUDUH,
en: this for a reason.

source: KENAPA KAKAK
en: Why are you

source: SEBELUM TERJADI
en: anything

source: YANG SEPERTI INI,
en: how you managed to be appointed

source: CHIARA?
en: everything?

source: ANGGOTA TEATER YANG
en: that the theater club member

source: JARANG AKU MERASA
en: I’ve never had the urge

source: KOK.
en: person.

source: TIDAK PERLU RAGU, TANYAKAN SAJA.
en: if you have any questions, don’t hesitate to ask.

source: BIASANYA AKTOR
en: most actors

source: TINDAKAN PENCEGAHAN.
en: multiple precautions.

source: SIH, AKU JUGA AKAN KECEWA.
en: I would be so disappointed.

source: WAKTIL KETUA OSIS,
en: the vice president of OSIS.

source: LAIN?
en: others?

source: APA YANG MEMBUATKU
en: then why

source: KALAU BEGITU, BAGAIMANA KALAU KITA LANGSUNG SAJA TANYA HARI INI?
en: then, why don’t we question him today?

source: BARUSAN SAYA
en: I’ve just

source: Eh…?
en: huh?

source: Kenapa kamu tidak menggunakan itu untuk mencari solusi?
en: ...why don’t you use that to find a solution?

source: *Suara mereka dipelankan
en: *they lower their voices

source: TINGGAL MENUNGGU
en: it’s only a matter of time

source: Apa ada balasan lagi darinya?
en: any response yet?

source: MEMPERTANYAKAN
en: after we know

source: ASLI, ORANG
en: Damn it,

source: LAINNYA…
en: is...

source: BAIK-BAI…
en: through as gentlemen--

source: K-KENAPA...
en: w-what...

source: KAU TAHU AKU TIDAK
en: that I was just messing around

source: TAMU KAMU 'KAN OSIS,
en: but you can’t let

source: HEI, AKU PUNYA SOPAN SANTUN, AKU TIDAK SEMBARANGAN MENGOREK INFO PERSONAL PAK NEV!
en: hey, I have manners. I wouldn’t dig up someone’s personal information unless there was a compelling reason to do so!

source: anggota OSIS yang
en: an OSIS member saw you

source: …Tapi mungkin ini hal yang bagus,
en: but... maybe it’s a good thing.

source: MUNGKIN SEBAIKNYA AKU BERHENTI...
en: maybe I should quit...

source: …BERKAT IBULAH
en: If it wasn’t for you,

source: INFORMASI,
en: more information for me.

source: AKU KESANNYA
en: it seems

source: HM?
en: Hmm?

source: Sekali dayung,
en: Killing two birds

source: KAFETERIA
en: go to the

source: ...KALAU BOLEH JUJUR, SAYA JUGA PUNYA KERAGUAN.
en: honestly, I also have my doubts.

source: Itu namanya gak sopan!
en: that would be rude!

source: INI SEMUA JADI JANGAN
en: all of this. So,

source: Kalau itu benar, artinya pesan yang dikirim ke Kak Leo adalah jebakan, agar perhatian sekolah terfokus kepada si pengirim pesan itu.
en: if it’s true, it means that the texts leo got were just a distraction, so everyone would pay attention to the sender instead.

source: RASANYA MENGGANJAL.
en: there’s something off about him.

source: KAMU SALAH
en: it wrong,

source: Masih juga
en: Are

source: ...TERNYATA TERJADI HAL BURUK SEPERTI ITU PADA KELUARGA KAK EZRA,
en: I can’t believe such a terrible thing happened to ezra’s family.

source: DEPAN GERBANG…
en: the school gate.

source: JAWAB,
en: person.

source: Aku sudah melakukan
en: I’ve done

source: AKU TIDAK AKAN
en: I wouldn’t be

source: INI ADALAH KELEBIHANKU,
en: this was a gift.

source: AKU BARU
en: We’ve

source: KEDENGARANNYA
en: Everything seems

source: BOLOSMU, YA?
en: Ezra.

source: INGIN KAMU TAU
en: want you to know

source: HANYA MEMANFAATKAN
en: was using

source: selama ini…
en: all this time...

source: SETIAP DIA AKAN
en: he was about to

source: MENYANGKAL APA
en: to deny anything that

source: DI SINI!!
en: now!

source: Taman Menara Jam,
en: Krisopras High Clock Tower,

source: SENDIRI!
en: you vermin!

source: ...SUPAYA BISA MENGALIHKAN PIKIRAN SEJENAK,
en: to clear my head...

source: …Apa orang-orang ini benar-benar penculik?
en: ...are they really kidnappers?!

source: …BENAR
en: well...

source: ...SELAMA INI,
en: up until now...

source: BENAR.
en: Correct.

source: SAYA TIDAK TAHU YANG
en: I don’t know

source: Ezra, Di mana terakhir kali kamu melihat mereka?
en: ezra, where did you last see them?

source: KENAPA MEREKA
en: why would they

source: MENGAWASI GERAK-
en: keep an eye

source: DIPERMAINKAN…
en: that you’ve been playing with her...

source: ...MUNGKIN LEBIH TEPATNYA, TENTANG "KELUARGA SANJAYA".
en: actually, this information is about the “sanjaya family”.

source: RUANG OSIS!
en: here!

source: Tapi sekolah pun tidak bisa menolong kami, kalau mereka tidak tahu di mana kami berada.
en: ...and the school can’t help us if they don’t know where we are.

source: *Nyanyi*
en: sing

source: DAN KENAPA
en: And why did we

source: SIH DARI TADI?
en: recently?

source: AAARGHHH!!
en: argggh!

source: BISA MEMAKSAKAN
en: we can’t just impose on

source: PIKIR TIDAK PERLU
en: there was no need

source: S-SAYA TAHU IBU
en: I knew

source: SUDAH JELAS, TENTU
en: To avoid

source: SEKILAS SAJA APA
en: what you two talked

source: SESEORANG MENGAKU
en: someone you didn’t even know

source: Sebentar lagi kita akan mendapatkan kabar tentang mereka.
en: ...we’ll hear from them soon.

source: N-NIH, SUDAH AKU BERSIHKAN!!
en: s-see, I’ve cleaned it up!

source: PANGGIL SAYA?
en: me here?

source: APA MAKSUDMU?
en: what do you mean?

source: Sebenarnya aneh…Kalau orang ini benar adalah mata-mata yang dimaksud Pak Ardhan, artinya dia seorang murid, bukan?
en: it’s strange... if this person is really a spy as Mr. Ardhan said, it means they aren’t a student, right?

source: TAHU ITU.
en: about this.

source: Cara bicara mereka sepertinya kok…
en: the way they speak...

source: tegang sekali…
en: intense...

source: CHIARA!?
en: me a message!

source: TERNYATA KAK
en: Ezra

source: SEBAGAI KETUA
en: of

source: E-EH,
en: H-huh,

source: JUGA TIDAK PERCAYA
en: the school hasn’t fully trusted me

source: TUJUAN SEKOLAH
en: school been doing

source: TANDA TANYA DI
en: to

source: TEMPAT DI MANA SAYA DIBESARKAN,
en: the place where I grew up...

source: ITULAH
en: So, we believe

source: APA-APAAN
en: what’s going

source: SEBENARNYA…
en: The truth is...

source: AKAN BICARAKAN
en: you finish your

source: ...AKU TAHU ITU SEBENARNYA RESPON YANG WAJAR,
en: I can understand how you feel...

source: TERHINDARI,
en: helped”?!

source: Bahkan Cantika juga sampai terlibat…
en: even cantika is involved...

source: Katakan saja.
en: just say it.

source: SAYA TIDAK
en: I don’t

source: K-KAK EZRA!
en: ezra!

source: MENUNGGU DI KELAS
en: is waiting in the adjacent

source: BUCIN DI SANA~!
en: boy!

source: UNTUK MEMBERITAHU
en: tell chiara

source: Walaupun jarang
en: Even though it’s rarely used,

source: JADI,
en: So, here’s the

source: PENGUSAHA BUTUH POLITIKUS YANG ADA DIPIHAK MEREKA.
en: those businessmen need to keep the politician on their side.

source: APAKAH SKENARIO
en: Does

source: GANGGU DIA UNTUK
en: let her

source: SEKOLAH INI
en: You might think

source: UNTUNG SAJA SUDAH TIDAK ADA SIAPA-SIAPA.
en: lucky me, nobody’s here.

source: PASTI TAHU IDENTITAS
en: knows about the real identity of

source: A-AKU TIDAK BERMAKSUD MEMBOHONGIMU.
en: I-I didn’t mean to lie to you.

source: DENGAN CHIARA
en: he was acting close

source: KAK LEO
en: Leo said he wanted

source: OSIS, KAN?
en: of OSIS?

source: KEAMANANMU.
en: your safety.

source: …Baiklah, aku mengerti.
en: okay... I understand.

source: sekali!
en: bad!

source: jadi tidak bisa
en: and can’t make it

source: YA, DAN SEPERTINYA DIA MENYALAHKAN KAGAGALANNYA ITU SELURUHNYA PADA KEPSEK.
en: yup, I think he blamed the headmaster for his own failure.

source: KARENA ITU SAYA
en: Therefore, I think It’d be

source: ORANG-ORANG YANG
en: with those you’ve told

source: KEREN!!
en: cool!!!

source: tidak bisa menagan otot senyum.
en: can’t hold his smile.

source: AKU TIDAK TAHU APA
en: I still have no idea

source: DIA DI PENGURUSAN
en: is very

source: DIA BILANG…
en: He said...

source: BERLEBIHAN,
en: out of line.

source: B-BUKAN, INI...!
en: no, it’s not...

source: SAYA KE IBU LEBIH
en: for you

source: LEBIH PENTING YANG
en: to deal

source: KELAS 11 YANG BERNAMA
en: the eleventh-grader who has been following you around,

source: TAPI JIKA IYA,
en: In this case,

source: waktu, ya!
en: huh?

source: Hei.
en: hey!

source: Kamu tidak terluka 'kan?
en: are you hurt?

source: dipakai, ruangan ini
en: this room is

source: OLEH SESEORANG.
en: by someone.

source: APA LAGI
en: What

source: INI DAN BERI HUKUMAN
en: him

source: TAPI PEMBICARAANKU
en: But, after i talked

source: DAN TIDAK AKAN MEMBIARKAN ADA SEORANG MURID PUN MENGALAMI HAL YANG SAMA LAGI.
en: we won’t let another student go through the same ordeal.

source: RENCANANYA…
en: flawlessly...

source: HEI...
en: hey...

source: TIDAK MEMBERITAHU
en: of not telling you my real

source: T-TENTU SAJA BUKAN!!
en: of course not!

source: KESALAHAN,
en: wrong.

source: SAJA MEMBUATKU
en: making me

source: DEKAT DENGAN
en: with the

source: Intip
en: peek

source: Mohon Tunggu Sebentar…
en: One moment later...

source: KAK.
en: now.

source: DARIPADA ITU, BERANI-BERANINYA KAMU DI SEKOLAH YANG SAKRAL INI..?
en: furthermore, how dare you do such a thing in this school!

source: Baik, pak
en: Yes,

source: PRANADIPA ITU SEDANG
en: and that Ezra guy aren’t

source: ~RINGAH
en: ~ling

source: KAMU BICARAKAN?
en: information?

source: SAMPAI KAPAN
en: How long

source: MASUKLAH.
en: Come in.

source: Istirahat kedua.
en: Second Recess.

source: MENGERTI KENAPA
en: know why

source: TUNJUKAN SEDIKIT
en: show some respect,

source: AKU ADA DI POSISINYA
en: were her,

source: WAH,
en: well,

source: SANGAT MEYAKINKAN.
en: how convincing.

source: ITU PASTI
en: That

source: APA KETUA
en: what’s

source: E-Eh..?
en: h-huh?

source: Niatnya hanya kilas
en: I was just trying

source: TANPA MENGETAHUI…
en: I didn’t know that...

source: TERIMA
en: Thank

source: KREK-
en: creak

source: ANAK INI PEDULI
en: has he

source: ADA BATASNYA!!
en: this to me!

source: SEPERTINYA AKU HANYA BISA MEMBUAT CHIARA SEMAKIN KESAL PADAKU...
en: I guess I just made her hate me even more...

source: JANGAN SAMAKAN
en: Don’t compare me

source: YANG FOKUS KE HAL-
en: who likes these

source: KARENA AKU BENCI
en: I hated

source: TERPERINCI PADAMU,
en: in detail because...

source: SAYA MENYADARINYA SAAT CHIARA MENOLONG EZRA DI KASUS REPORTER KEMARIN.
en: I realized this when she helped ezra during that reporter case.

source: HUBUNGANNYA DENGAN
en: why

source: KALAU TIDAK
en: People only

source: HA . . .
en: huh

source: DENGAN KAK LEO.
en: from Leo.

source: SELAMA KAMI BISA, KAMI AKAN MENJAWABNYA.
en: let us know if we can help.

source: Lagi-lagi, saya membuat keputusan buruk.
en: I made another bad decision.

source: suaramu-
en: voice-!

source: MERAPALKAN
en: reciting

source: AKU MENGUPING
en: I’ve been eavesdropping on

source: YANG LAKUKAN ITU,
en: have to be the one to do it?

source: SEBENTAR, SEBENTAR,
en: W-wait!

source: JADI SAYA MERASA KALIAN PASTI PUNYA ALASAN YANG KUAT DIBALIK SEMUA INI.
en: so I think there’s a good reason behind it.

source: emosi!
en: It’s irritating!

source: SAYA TIDAK TAHU APAKAH MEREKA MELAKUKANNYA HANYA KARENA DIPERINTAH...
en: well, maybe they were just following orders.

source: JUGA!
en: too!

source: AKU LAKUKAN,
en: applies...

source: TEP
en: Pat

source: YA??
en: gone mad?!

source: BERTENGKAR, YA?
en: on good terms.

source: TEPAT.
en: comes.

source: OSIS YANG LAIN.
en: don’t have this privilege.

source: KARENA SITUASI SELALU MEMBURUK SETIAP KALI AKU IKUT CAMPIR...
en: the situation always gets worse every time I interfere...

source: SAAT ITU
en: Ezra had done

source: TIDAK NORMAL!!
en: wrong with me!

source: CHIARA!!
en: with her!!!

source: DARI CARA LEO BICARA KEMARIN, SEPERTINYA TUJUANNYA ADALAH MEMBUATMU KECEWA DENGAN SEMUANYA.
en: based on what leo said, I think his true purpose is to make you disappointed with everything.

source: Menyedihkan…
en: wake me up...

source: TEATER, LEO.
en: theater club, Leo.

source: DENGAN SENIOR EZRA
en: Ezra Pranadipa

source: HARI INI
en: Mr. Nevada

source: T-Tidak kok!
en: n-no!

source: UKH,
en: UGH.

source: TIDAK BISAKAH KAU BERSIMPATI SEDIKIT!?
en: can you please show a little bit of sympathy?!

source: TAPI,
en: however...

source: MEMILIH LEO,
en: Leo, though.

source: JUGA MENGALIHKAN
en: to distract myself

source: MERASA KALAU
en: believe

source: ANAK YANG PENURUT
en: an obedient

source: MUNGKIN MEREKA
en: Hmm... i don’t know.

source: BUKAN..??
en: again...

source: TIDAK SIBUK,
en: OSIS,

source: UNTUK MENGANTAR
en: to bring some

source: AWAS KALAU KAMU MACAM-MACAM.
en: don’t do anything stupid.

source: TUGASMU
en: on your mission,

source: DAN DITAMBAH LAGI
en: Besides,

source: ...JADI SINGKATNYA,
en: right. so, in short...

source: KAK LEO JUGA SUDAH
en: Leo has asked

source: KAU SENGAJA
en: You’re

source: PERTANYAANKU TENTANG
en: for all the things I’ve been meaning to ask

source: MASALAH PRIBADINYA
en: personal

source: JELAS MENUNJUKKAN
en: I’ve realized that

source: SECARA SINGKAT
en: So, I guess

source: AKAN BANYAK
en: will always

source: Jam pulang sekolah.
en: After school.

source: EHHH???
en: huhhhh?!

source: "ORANG LUAR" YANG
en: “outsider” who’s been

source: KESENANGANKU SENDIRI!
en: for my own pleasure, you know?!

source: Ruang OSIS.
en: OSIS secret room.

source: JADI BAGAIMANA BISA AKU DIAM SAJA SAAT ADA MASALAH YANG BERKAITAN DENGAN TEMANKU?
en: how can I run away when my dear friend needs my help?

source: KENAPA KAK LEO
en: Why did Leo

source: bicara soal ini?
en: you know?

source: Dia 'kan
en: Isn’t he

source: KEMARIN…
en: yesterday...

source: APA LAGI YANG KAKAK-
en: what are you-?

source: Itu 'kan imajinasiku tadi!!
en: that's just what I was thinking!

source: YANG MENGHINDARI
en: who’s been avoiding

source: INI MEMILIKI
en: a

source: TAPI EKSPRESIMU
en: It’s just that

source: KAGET.
en: surprised.

source: SEMAKIN AKUR…
en: and get to know each other...

source: SAYA HARUS TERLIHAT MARAH DENGAN OSIS?
en: I’ll have to act as if I’m disappointed in osis?

source: SEKALI AKU TIDAK
en: since I

source: SEPERTINYA WAKATOS DAN EZRA PRANADIPA ITU SEDANG BERTENGKAR, YA?
en: did the vice president and ezra pranadipa get into a fight?

source: SEDERHANA…
en: background like you...

source: Saya sih tidak apa, tapi dia masih kecil…Ikatan sekencang ini akan melukainya…!
en: I’m fine, but she’s just a kid... strong ties can hurt her.

source: HAL SERUMIT INI?
en: complicated?

source: SAYA BISA MENGEMBANGKAN
en: I wouldn’t be

source: LEO TERTARIK DENGAN
en: in the Vice President,

source: MEMALUKAN, JANGAN
en: I can’t let anyone else

source: KALIAN MENCURIGAI KEVIN SANJAYA YANG TIBA-TIBA MENDEKATI CHIARA, MENGUMPULKAN INFORMASI...
en: ...because of your suspicions about kevin sanjaya, who had become close to chiara, you dug up some information on him...

source: SUATU SOSOK.
en: figure.

source: Kami hanya menjalankan perintah atasan.
en: we just do what the boss told us.

source: SULIT DIDAPAT, TAHU!
en: you know?!

source: AKU HERAN KENAPA
en: as the secretary of OSIS twice,

source: Karena selalu belajar.
en: because she always studied.

source: kau suruh-suruh
en: around

source: SIH TIDAK APA-APA,
en: by me,

source: KELUARGA YANG
en: a very complicated

source: TERBURUK…
en: worst...

source: AKU HARUS SEGERA
en: I’d better go

source: APAPUN JENIS
en: Regardless of

source: apa-apa kepada dia.
en: everything to her.

source: YANG MEMENUHI
en: the one

source: kebingungan.
en: bamboozled.

source: KAU TAKUT
en: are you afraid

source: KE IBU TIDAK
en: are

source: TIDAK TAHU APA-APA
en: if I keep you in the dark

source: KALAU TIBA-TIBA
en: If i do something

source: DIA MENUTUPI
en: covering this

source: PERNAH BILANG,
en: that

source: YANG AKU DAPATKAN
en: the impression that I got

source: ada urusan penting,
en: emergency

source: Kami akan memberi kalian ruang dulu untuk menenangkan diri.
en: we’ll give you space to calm down.

source: Apa aku benar-benar tinggalkan HP-ku saja ya…
en: do I just leave my phone?

source: KAMU TERLIBAT.
en: involved in this.

source: BENAR, APA YA?
en: good question.

source: YANG BERANI DENGAN
en: stand up

source: ARTINYA…
en: S-so...

source: SEMENTARA ITU,
en: Meanwhile.

source: AKU AKAN KELUAR DULUAN YA KAK.
en: I’ll go first.

source: SEPERTI ITU…
en: like this...

source: SMA KRISOPAS
en: Krisopras High

source: ITU YANG
en: That’s what

source: HEH,
en: tsk...

source: OH BEGITU..?
en: I see...

source: BERDUA.
en: conversation.

source: TERJADI PADAMU.
en: to you.

source: UMM… APA
en: Umm...

source: RASA RAGU DAN
en: and, of course,

source: PAK NEV PUN
en: is so cool

source: 2-3 pulau terlewati!
en: with one stone!

source: EZRA DAN ANGGOTA OSIS LAINNYA HARUS MENGAMATI DARI JAUH.
en: ezra and the others in osis should watch her from a distance.

source: belum bilang
en: said

source: DRTT
en: bzzt

source: TAPI SEBENARNYA
en: But, I know for sure that

source: KAMU MENCARIKU
en: I didn’t expect you’d

source: NAOMI ADALAH FANS
en: Naomi is a fan

source: Maaf saya telat bergabung, saya sudah tidak bisa berlari secepat Nevada.
en: I’m sorry for joining late. I’m no longer able to run as fast as nevada.

source: DIA,
en: He is...

source: Kenapa?
en: about what?

source: TERNYATA KETUA
en: know that

source: JADI SAYA TIDAK
en: So I can’t

source: INFORMASI.
en: for OSIS.

source: BIASA, HEDWIG PUN
en: Hedwig

source: MENGERTI,
en: Now I understand.

source: DARI LATAR BELAKANG
en: with a not-so-special

source: BANYAK YANG
en: There are still so many things

source: Trenggiling?
en: is he a pangolin?

source: BANTUAN… INI TIDAK
en: help recently... You’re not always like this,

source: H-HEI, APA SALAHNYA TELAT SEDIKIT KE LATIHAN..??
en: he-hey, it can wait, right?

source: SAYA LIHAT ADA SESUATU DI RAMBUT CHIARA!
en: actually, I saw something on chiara’s hair!

source: SESAMPAINYA
en: When she arrived at the

source: SEBENARNYA APA
en: why has the

source: Sudah cukup.
en: that’s enough.

source: latihan.
en: to practice.

source: Loh, 'nak Noomi?
en: hi, naomi.

source: Sosok..?
en: figure?

source: BANYAK KAMU TAHU,
en: you know,

source: SIAL, KENAPA
en: Shoot!

source: HEI, TIDAK BIASANYA
en: What a surprise,

source: BUKAN BERTENGKAR YANG
en: didn’t exchange any blows.

source: MEMANGNYA ITU SALAH??
en: what was so wrong with that?

source: KAU CEMBURU
en: you were

source: BOLEH TERLALU
en: control myself. I’m not gonna

source: SADAR JUGA?
en: realized, huh?

source: AKAN MENGHUBUNGI
en: I’ll talk to her

source: SAMPAI MELAKUKAN
en: something this

source: K-KALAU TERLALU
en: If I do it too soon,

source: NANTI KALAU KAMU
en: Do you want me

source: KENAPA MENDENGAR
en: Why am I

source: NGOMONG-NGOMONG
en: Anyway,

source: DUH,
en: Hey,

source: MURID ITU UNTUK
en: you for its

source: EZRA DAN ERLANGGA.
en: and Erlangga.

source: DENGAN HAL
en: would care about something

source: DIPERCAYAKAN
en: in

source: MELINDUNGI
en: to protect

source: ...TAPU SETELAH MENDENGAR APA YANG ANAK-ANAK ITU KATAKAN,
en: also, after hearing what those brats had to say,

source: PEMBICARAAN MEREKA
en: their

source: SEJAK KECIL
en: You haven’t

source: KENAPA TIBA-
en: what’s

source: APAKAH AKU
en: if I am one of those people

source: ADUH, MATAKU
en: Oh, no! I made

source: 'kan??
en: around!!!

source: LAGI-LAGI KEJADIANNYA SELALU SEPERTI INI??
en: ...keep seeing this dreadful scene?!

source: SAYA AKAN BERUSAHA UNTUK MENGURANGI KEBIASAAN INI SAAT MENYELESAIKAN MASALAH.
en: I’ll do my best to stay away from this approach when tackling a problem.

source: ALASAN KALIAN DARI TADI RAGU-RAGU MEMBICARAKAN INI...
en: ...you've been hesitant to talk about it...

source: DI situ kau rupanya!
en: there you are!

source: BALASAN,
en: me!

source: TIDAK SESUAI DENGAN
en: he’s not the man
